At least two Slope Defining Lines are needed to perform Align Eaves.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NeedsTwoToAlignEaves { get; }
  Visual Basic
Public Shared ReadOnly Property NeedsTwoToAlignEaves As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NeedsTwoToAlignEaves {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DetailFailures Class
  Autodesk.Revit.DB Namespace